# Brewfile for Android-focused macOS setup

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# CLI Tools - Core Unix utilities
brew "coreutils"        # GNU core utilities
brew "findutils"        # GNU find, locate, updatedb, xargs
brew "gnu-tar"          # GNU tar
brew "gnu-sed"          # GNU sed
brew "gawk"             # GNU awk
brew "gnutls"           # GNU TLS library
brew "gnu-getopt"       # GNU getopt
brew "grep"             # GNU grep

# Essential CLI tools
brew "git"
brew "curl"
brew "wget"
brew "tree"
brew "htop"
brew "neofetch"
brew "mas"              # Mac App Store CLI

# Modern CLI replacements
brew "bat"              # Better cat
brew "exa"              # Better ls
brew "fd"               # Better find
brew "ripgrep"          # Better grep
brew "fzf"              # Fuzzy finder
brew "delta"            # Better git diff

# Development tools
brew "neovim"
brew "tmux"
brew "node"             # Useful for tooling
brew "python@3.11"      # Useful for scripts
brew "jq"               # JSON processor

# Network tools (Linux essentials)
brew "nmap"              # Network scanning
brew "netcat"            # Network debugging
brew "socat"             # Socket utilities
brew "mtr"               # Network diagnostics
cask "wireshark"         # Network protocol analyzer

# System monitoring (Linux-style)
brew "glances"           # Better htop alternative
brew "iotop"             # I/O monitoring
brew "lsof"              # List open files
brew "duf"               # Better df
brew "dust"              # Better du
brew "procs"             # Better ps

# Container and virtualization
brew "docker"            # Containerization
brew "docker-compose"    # Container orchestration
brew "colima"            # Docker runtime for macOS

# Security tools
brew "gnupg"             # GPG encryption
brew "openssh"           # SSH client/server
brew "openssl"           # Crypto library

# Android development
brew "scrcpy"           # Android screen mirroring
brew "adb-enhanced"     # Better ADB

# Shell enhancements
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# GUI Applications
cask "iterm2"           # Better terminal
cask "rectangle"        # Window management
cask "raycast"          # Better Spotlight
cask "visual-studio-code"
cask "hiddenbar"        # Menu bar management
cask "appcleaner"       # Proper app uninstaller
cask "marta"            # File manager
cask "google-chrome"    # Web browser

# Android development tools
cask "jetbrains-toolbox"

# Mac App Store apps
mas "Xcode", id: 497799835